Revit 2024 API
BuiltInFailures.ForeignFileFailures.ForeignFile Property
 This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ForeignFile { get; }
Visual Basic
Public Shared ReadOnly Property ForeignFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ForeignFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ForeignFileFailures Class
Autodesk.Revit.DB Namespace